perf/jmeter/S1-activity-detail.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  S1 活动详情读 —— 文档目标：5000 并发 / 3 min / P99 < 50ms / 错误率 0 / Redis 命中率 > 99%

  这个接口**允许匿名**（JwtAuthFilter 的 optional 分支），所以不需要 users.csv。
  它测的是「逻辑过期 + 单飞重建 + 空值缓存」那套缓存：稳态下应该几乎全部命中 Redis，
  只有 TTL 到点的那一瞬间有一个线程去重建。

  注意 serverTime / 活动状态 / 库存这三个字段是**每次重算**的（不进缓存），
  所以即使命中缓存也不是纯粹的 Redis GET —— P99 里包含这部分计算。

  参数：-Jhost -Jport -Jactivity -Jthreads -Jduration -Jrampup
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="S1 活动详情读" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="UDV" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">${__P(host,127.0.0.1)}</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">${__P(port,8080)}</stringProp>
          </elementProp>
          <elementProp name="ACTIVITY" elementType="Argument">
            <stringProp name="Argument.name">ACTIVITY</stringProp>
            <stringProp name="Argument.value">${__P(activity,1)}</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 默认值" enabled="true">
        <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${PORT}</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">3000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- Keep-Alive 必须开。关掉的话每个请求都要三次握手，
           Windows 上还会迅速耗尽临时端口（TIME_WAIT 堆积），
           表现是压到一半开始大量 connect timeout —— 那是压测机的问题，不是被测系统的 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="活动详情读" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__P(threads,200)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,10)}</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,60)}</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/activity/{id}" enabled="true">
          <stringProp name="HTTPSampler.path">/api/activity/${ACTIVITY}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- 只断言 code=0。不断言库存值：它每次都在变，断言了会把
               「库存被别人抢掉」误报成失败 -->
          <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="断言 code=0" enabled="true">
            <stringProp name="JSON_PATH">$.code</stringProp>
            <stringProp name="EXPECTED_VALUE">0</stringProp>
            <boolProp name="JSONVALIDATION">true</boolProp>
            <boolProp name="EXPECT_NULL">false</boolProp>
            <boolProp name="INVERT">false</boolProp>
            <boolProp name="ISREGEX">false</boolProp>
          </JSONPathAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>